DataProcessors/АРМСтаршийВодитель_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АРМСтаршийВодитель_2</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ПутевойЛист_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПутевойЛист_2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеТары</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыАптека</xr:Item>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
				<xr:Item>InformationRegister.РегТарыПоШК</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыВодитель</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьКонтрагентов</Name>
					<Comment>Если ИСТИНА то при сохранении будет объединять контрагентов в один документ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПрихода</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратныеСФ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФНомерСчетфактуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФКонтрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФКомментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратнаяСчетФактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/АРМСтаршийВодитель_2/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокБЯСДляПутевыхЛистовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Сообщить(Элементы.СписокБЯСДляПутевыхЛистов.ТекущиеДанные.ДокументПрихода);
	Если РедактироватьПутевыеЛисты Тогда
	ДобавитьСФвПутевойЛист(Null);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПутевойЛист(Команда)
	Если НЕ ЗначениеЗаполнено(Водитель) Тогда
		Сообщить("Выберите водителя.");
		Возврат;	
	КонецЕсли;
	СоздатьПутевойЛистСЕРВЕР();
	ОбновитьСписки();
КонецПроцедуры

&НаСервере
Процедура СоздатьПутевойЛистСЕРВЕР()
	//Ищем Путевой Лист Для Водителя на Сегодня
	поискПутевойЛист=модСерверПолныеПрава.НайтиПутевойЛист_2(Водитель,НачалоДня(ТекущаяДата()));
	Если поискПутевойЛист<>Неопределено Тогда
		
		Сообщить("Путевой лист для водителя "+Водитель + " уже есть.");
		Возврат;	
	КонецЕсли;
	
	//Создаем пустой Путевой Лист
	новыйДок=Документы.ПутевойЛист_2.СоздатьДокумент();
	новыйДок.Дата=НачалоДня(ТекущаяДата());
	новыйДок.Водитель=Водитель;
	новыйДок.Записать(РежимЗаписиДокумента.Запись);
	Сообщить("Создан Путевой Лист для "+Водитель);
	 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки()
	Элементы.СписокБЯСДляПутевыхЛистов.Обновить();
	Элементы.ТекущиеПутевыеЛисты.Обновить();
	Элементы.ТекущиеПутевыеЛистыДанные.Обновить();
	Элементы.ПутевыеЛисты.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСФвПутевойЛист(Команда)
	
	ДокПЛ=Элементы.ТекущиеПутевыеЛисты.ТекущиеДанные.Ссылка;
	ДокБЯС=Элементы.СписокБЯСДляПутевыхЛистов.ТекущиеДанные.ДокументПрихода;
	
	ДобавитьСФвПутевойЛистСЕРВЕР(ДокПЛ,ДокБЯС);
    ОбновитьСписки();
	//ОбновитьТЧ
	ТекСТР=Элементы.ТекущиеПутевыеЛисты.ТекущаяСтрока;
	Элементы.ТекущиеПутевыеЛисты.ТекущаяСтрока=-1;
	Элементы.ТекущиеПутевыеЛисты.ТекущаяСтрока=ТекСТР;
	
КонецПроцедуры

&НаСервере
Процедура  ДобавитьСФвПутевойЛистСЕРВЕР(ДокПЛссылка,ДокБЯСссылка)
	
	ДокПЛ=ДокПЛссылка.ПолучитьОбъект();
	//Проверка на задвоенность
	поискБЯС=ДокПЛ.Данные.Найти(ДокБЯСссылка,"ДокументПрихода");
	Если  поискБЯС<>Неопределено Тогда
		Сообщить("Эта СчетФ уже в путевом листе.");
		Возврат;
	КонецЕсли;
	//Добавляем СФ
	новаяСтрока=ДокПЛ.Данные.Добавить();
	новаяСтрока.ДокументПрихода=ДокБЯСссылка;
	ДокПЛ.Записать(РежимЗаписиДокумента.Проведение);
		
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСФизПутевогоЛиста(Команда)
	
	Если РедактироватьПутевыеЛисты Тогда
	ДокПЛ=Элементы.ТекущиеПутевыеЛисты.ТекущиеДанные.Ссылка;
	ДокБЯС=Элементы.ТекущиеПутевыеЛистыДанные.ТекущиеДанные.ДокументПрихода;
	УдалитьСФизПутевогоЛистаСЕРВЕР(ДокПЛ,ДокБЯС);
    ОбновитьСписки();
Иначе
	Сообщить("Редатирование НЕ разрешено.");
	КонецЕсли;
КонецПроцедуры

  &НаСервере
Процедура  УдалитьСФизПутевогоЛистаСЕРВЕР(ДокПЛссылка,ДокБЯСссылка)
	
	ДокПЛ=ДокПЛссылка.ПолучитьОбъект();
	//Проверка на задвоенность
	поискБЯС=ДокПЛ.Данные.Найти(ДокБЯСссылка,"ДокументПрихода");
	Если  поискБЯС=Неопределено Тогда
		Сообщить("Этой СчетФ НЕТ в путевом листе.");
		Возврат;
	КонецЕсли;
	//Удаляем СФ
	ДокПЛ.Данные.Удалить(поискБЯС);
	ДокПЛ.Записать(РежимЗаписиДокумента.Проведение);
    
	//Удаляем ПЛ Из БЯС
	ДокБЯС=ДокБЯСссылка.ПолучитьОбъект();
	ДокБЯС.ПутевойЛист="";
	ДокБЯС.Записать(РежимЗаписиДокумента.Запись);
			
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписки();

КонецПроцедуры

&НаКлиенте
Процедура ТекущиеПутевыеЛистыПриАктивизацииСтроки(Элемент)
	Попытка
		//СС=Элементы.ТекущиеПутевыеЛисты.ТекущиеДанные.Ссылка;
		//ТекущиеПутевыеЛистыДанные.Параметры.УстановитьЗначениеПараметра("Ссылка",СС );
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		//ТекущиеПутевыеЛистыДанные.Параметры.УстановитьЗначениеПараметра("Ссылка","" );
КонецПроцедуры
